OdRxUiPlacementAttribute.getWeight(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Returns the UI weight for this member.
\param member [in]  Member to get weight of.
\returns
Weight as float value.

OdRxUiPlacementAttribute.getCategory(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the UI category for this member.
\param member [in]  Member to get category of.
\returns
Category name.

OdRxUiPlacementAttribute.createObject(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.UInt32)
\details
Constructor. Creates the attribute to store UI category and weight.
\param category [in]  Category name.
\param weight   [in]  Weight.
\returns
Smart pointer to the created attribute.